//добавяме различните етапи на играта

//етап 1
string[] stage1 = 
{ 
    "Вие сте в мрачна пещера. Пред вас има два тунела - 'ляво' и 'дясно'. Кой път избирате?" 
};

//етап 2
string[] stage2 =
{
    "Пред вас се появява чудовище. Изберете 'бий се' или 'бягай'.",
    "Продължавате напред и виждате река и дървено мостче. Изберете 'мини по моста' или 'заобиколи реката'."
};

//етап 3
string[] stage3 =
{
    "Успяхте да победите чудобището и продължавате напред.",
    "Успяхте да избягате от чудовището и продължавате напред.",
    "Преминахте по моста и достигнахте другия край на реката.",
    "Заобиколихте реката и продължавате напред."
};

//етап 4
string[] stage4 =
{
    "Изведнъж в далечината виждате светлина и намирате изхода от пещерата."
};

//тъй като при етап 2 и 3 има избор правим променливи, който в последстие ще ни помогнат за играта
int s2 = -1;//етап 2
int s3 = -1;//етап 3 

//Метод за начало на играта
void Start()
{
    int count = 1;//брояч, който ще брой етапите

    //правим метод за показване на дадения етап
    //знам, че не е много препоръчително да се декларира метод в метод
    
    void ShowStage(int stage)
    {
        
        switch (stage)
        {
            case 1:
                Console.WriteLine(stage1[0]);
                count++;
                break;
            case 2:
                string input =Console.ReadLine();
                CheckStage2(input);
                Console.WriteLine(stage2[s2]);
                count++;
                break;
            case 3:
                input = Console.ReadLine();
                CheckStage3(input);
                Console.WriteLine(stage3[s3]);
                count++;
                break;
            case 4:
                Console.WriteLine(stage4[0]);
                count++;
                break;
            
        }
    }

    //проверяваме етапа
    while (count <= 4)
    {
        //показваме етапа
        ShowStage(count);
    }
    
    //ако етапа е 5 директно го показваме на ектана
    Console.WriteLine("Край на играта!");
}

//метод за проверка на етап 2
void CheckStage2(string input)
{
    //според това, което е въвел потребителя променливата за етап 2 се променя
    switch (input)
    {
        //за "ляво" ще отгоравя 0
        case "ляво": s2=0;break;

        //за "дясно" ще отговаря 1
        case "дясно": s2= 1;break;

        // ако потребителя е въвел грени входни данни излизаме от програмата
        default:
            Console.WriteLine("Wrong input!");
            Environment.Exit(0);
            break;
    }
}

//същото се повтаря и за метод 3
void CheckStage3(string input)
{
    switch (input)
    {
        //за "бий се" ще отговаря 0
        case "бий се":
            s3=0;
            break;

        // за "бягай" ще отговаря 1
        case "бягай":
            s3=1;
            break;

        //за "мини по моста" ще отговаря 2
        case "мини по моста":
            s3=2; 
            break;

        // за "заобиколи пеката" ще отговаря 3
        case "заобиколи реката":
            s3=3;
            break;

        // ако потребителя е въвел грени входни данни излизаме от програмата
        default:
            Console.WriteLine("Wrong input!");
            Environment.Exit(0);
            break;
    }
}

//стартираме играта
Start();